Repository: ShahriarMalik/my-vocabulary-app
Catalog: frontend/vocabulary-frontend/src/locale/messages.*.xlf
Languages: de

source: Home
de: Startseite

source: Login Required
de: Anmeldung erforderlich

# loggedinMessage
source: You must be logged in to access this page.
de: Sie müssen angemeldet sein, um auf diese Seite zuzugreifen.

source: Unsaved Changes
de: Ungespeicherte Änderungen

# unsavedMessage
source: You have unsaved changes. Do you really want to leave this page?
de: Sie haben ungespeicherte Änderungen. Möchten Sie diese Seite wirklich verlassen?

# exercisesManagementTitle
source: Exercises Management
de: Übungsverwaltung

# cefrLevelLabel
source: CEFR Level
de: CEFR-Niveau

# selectLessonLabel
source: Select Lesson
de: Wählen Sie eine Lektion

# selectLessonNumber
source: Lesson
de: Lektion

# selectCefrLessonNotice
source: Please Select CEFR Level and Lesson to proceed
de: Bitte wählen Sie ein CEFR-Niveau und eine Lektion, um fortzufahren

# wordHeader
source: Word
de: Wort

# exerciseTypeHeader
source: Exercise Type
de: Übungstyp

# enterTypePlaceholder
source: Enter type
de: Geben Sie den Typ ein

# questionHeader
source: Question
de: Frage

# enterQuestionPlaceholder
source: Enter question
de: Geben Sie die Frage ein

# optionsHeader
source: Options
de: Optionen

# enterOptionsPlaceholder
source: Enter options
de: Geben Sie Optionen ein

# answerHeader
source: Answer
de: Antwort

# enterAnswerPlaceholder
source: Enter answer
de: Geben Sie die Antwort ein

# actionsHeader
source: Actions
de: Aktionen

source: No data available
de: Keine Daten verfügbar

source: All fields are required
de: Alle Felder sind erforderlich

source: Exercise updated successfully
de: Übung erfolgreich aktualisiert

source: Error updating exercise
de: Fehler beim Aktualisieren der Übung

source: Error creating exercise
de: Fehler beim Erstellen der Übung

# wordManagementTitle
source: Word Management
de: Wortverwaltung

# searchWordLabel
source: Search Word
de: Wort suchen

# searchWordPlaceholder
source: Enter word to fetch
de: Wort eingeben, um es abzurufen

# fetchWordButton
source: Fetch Word
de: Wort abrufen

# wordLabel
source: Word
de: Wort

# exampleLabel
source: Example
de: Beispiel

# translationLabel
source: Translation
de: Übersetzung

# translatedLanguageLabel
source: Translated Language
de: Übersetzte Sprache

# saveButton
source: Save
de: Speichern

source: An unexpected error occurred. Please try again later
de: Ein unerwarteter Fehler ist aufgetreten. Bitte versuchen Sie es später noch einmal.

source: Sign Up
de: Registrieren

source: Login
de: Anmelden

source: Password Reset
de: Passwort zurücksetzen

# loginTitle
source: Login
de: Anmelden

# emailRequired
source: Email is required.
de: E-Mail ist erforderlich.

# invalidEmail
source: Invalid email address.
de: Ungültige E-Mail-Adresse.

# passwordLabel
source: Password
de: Passwort

# passwordRequired
source: Password is required.
de: Passwort ist erforderlich.

# passwordMinLength
source: Password must be at least 6 characters long.
de: Das Passwort muss mindestens 6 Zeichen lang sein.

# loginButton
source: Login
de: Anmelden

# forgotPasswordButton
source: Forgot Password?
de: Passwort vergessen?

# passwordResetTitle
source: Password Reset
de: Passwort zurücksetzen

# resetPasswordButton
source: Reset Password
de: Passwort zurücksetzen

# signUpTitle
source: Sign Up
de: Registrieren

# usernameLabel
source: User Name
de: Benutzername

# usernameRequired
source: User Name is required.
de: Benutzername ist erforderlich.

# usernameMinLength
source: User Name must be at least 3 characters long.
de: Der Benutzername muss mindestens 3 Zeichen lang sein.

# emailExists
source: Email already exists.
de: E-Mail existiert bereits.

# signUpButton
source: Sign Up
de: Registrieren

# cefrLevelAriaLabel
source: Select CEFR Level
de: Wählen Sie CEFR-Niveau

# lessonLabel
source: Select Lesson:
de: Lektion wählen:

# lessonAriaLabel
source: Select Lesson
de: Lektion wählen

# lessonNumber
source: Lesson
de: Lektion

# errorMessageAriaLabel
source: Error message
de: Fehlermeldung

# successMessageAriaLabel
source: Success message
de: Erfolgsmeldung

# questionPrefix
source: What is the meaning of
de: Was bedeutet im Englischen

# submitButton
source: Submit Answer
de: Antwort absenden

# paginatorAriaLabel
source: Pagination control
de: Seitennavigation

# noDataAvailableMessage
source: No data available for the selected CEFR level
de: Keine Daten für das ausgewählte CEFR-Niveau verfügbar

# errorSomethingWentWrong
source: Something went wrong. Please try again later.
de: Etwas ist schief gelaufen. Bitte versuchen Sie es später noch einmal.

# noExerise
source: No exercise available for the selection at this moment
de: Für die Auswahl ist momentan keine Übung verfügbar

# correctAnswer
source: Correct!
de: Richtig!

# incorrectAnswer
source: Incorrect!
de: Falsch!

source: Learn
de: Lernen

source: Exercises
de: Übungen

source: Words Management
de: Wortverwaltung

source: Exercises Management
de: Übungsverwaltung

source: Progress
de: Fortschritt

source: Tips
de: Tipps

# heroTitle
source: VokabelProfi: Master German Vocabulary
de: VokabelProfi: Beherrschen Sie den deutschen Wortschatz

# heroDescription
source: Experience level-based learning with content aligned to the Common European Framework of Reference for Languages (CEFR) for a more organized and personalized learning journey. Interactive exercises, progress tracking, and seamless multi-device support.
de: Erleben Sie niveaubasiertes Lernen mit Inhalten, die dem Gemeinsamen Europäischen Referenzrahmen für Sprachen (GER) entsprechen, für eine besser organisierte und personalisierte Lernreise. Interaktive Übungen, Fortschrittsverfolgung und nahtlose Unterstützung auf mehreren Geräten.

# startLearningTitle
source: Start learning with VokabelProfi
de: Beginnen Sie mit VokabelProfi zu lernen

# startLearningButton
source: Start Learning
de: Jetzt lernen

# structuredLearningTitle
source: Structured Learning Path
de: Strukturierter Lernpfad

# structuredLearningDescription
source: Follow a well-organized curriculum aligned with CEFR for comprehensive language mastery.
de: Folgen Sie einem gut organisierten Lehrplan, der dem GER entspricht, für eine umfassende Sprachbeherrschung.

# engagingExercisesTitle
source: Engaging Exercises
de: Fesselnde Übungen

# engagingExercisesDescription
source: Dive into a variety of interactive exercises to reinforce vocabulary and language skills.
de: Tauchen Sie ein in eine Vielzahl von interaktiven Übungen, um Ihren Wortschatz und Ihre Sprachfähigkeiten zu festigen.

# progressTrackingTitle
source: Progress Tracking
de: Fortschrittsverfolgung

# progressTrackingDescription
source: Monitor your learning journey with real-time progress tracking and personalized feedback.
de: Überwachen Sie Ihre Lernreise mit Echtzeit-Fortschrittsverfolgung und personalisiertem Feedback.

# pronunciationTitle
source: Pronunciation
de: Aussprache

# pronunciationDescription
source: Improve your pronunciation and understanding with integrated translation services and audio features.
de: Verbessern Sie Ihre Aussprache und Ihr Verständnis mit integrierten Übersetzungsdiensten und Audiofunktionen.

# interactiveDemoTitle
source: Try an Exercise
de: Probieren Sie eine Übung aus

# interactiveDemoDescription
source: Experience a sample exercise and see how VokabelProfi can enhance your German vocabulary skills.
de: Erleben Sie eine Beispielübung und sehen Sie, wie VokabelProfi Ihre deutschen Wortschatzfähigkeiten verbessern kann.

# chooseAnswerTitle
source: Choose an answer
de: Wählen Sie eine Antwort

# submitAnswerTitle
source: Please select an answer
de: Bitte wählen Sie eine Antwort

# submitAnswerButton
source: Submit Answer
de: Antwort absenden

# exploreMoreTitle
source: Explore more exercises
de: Entdecken Sie mehr Übungen

# exploreMoreButton
source: Explore More Exercises
de: Mehr Übungen entdecken

# testimonialsTitle
source: What Our Users Say
de: Was unsere Benutzer sagen

# faqTitle
source: Frequently Asked Questions
de: Häufig gestellte Fragen

# faqQ1Title
source: How does VokabelProfi work?
de: Wie funktioniert VokabelProfi?

# faqQ1Description
source: VokabelProfi offers personalized exercises to help you master German vocabulary with interactive tools and real-time progress tracking. The platform follows a structured learning path based on the Common European Framework of Reference for Languages (CEFR), ensuring that your learning journey is aligned with standardized language proficiency levels. Best of all, the service is completely free!
de: VokabelProfi bietet personalisierte Übungen, um Ihnen zu helfen, den deutschen Wortschatz mit interaktiven Werkzeugen und Echtzeit-Fortschrittsverfolgung zu beherrschen. Die Plattform folgt einem strukturierten Lernpfad basierend auf dem Gemeinsamen Europäischen Referenzrahmen für Sprachen (GER), um sicherzustellen, dass Ihre Lernreise den standardisierten Sprachkompetenzstufen entspricht. Und das Beste daran: Der Service ist völlig kostenlos!

# faqQ2Title
source: Can I track my progress?
de: Kann ich meinen Fortschritt verfolgen?

# faqQ2Description
source: Yes, the platform tracks your progress in real-time and provides detailed reports on your learning activities.
de: Ja, die Plattform verfolgt Ihren Fortschritt in Echtzeit und bietet detaillierte Berichte über Ihre Lernaktivitäten.

# faqQ3Title
source: What translation services are integrated?
de: Welche Übersetzungsdienste sind integriert?

# faqQ3Description
source: VokabelProfi integrates DeepL API for translations and Google Translation API for audio pronunciation services.
de: VokabelProfi integriert die DeepL-API für Übersetzungen und die Google-Übersetzungs-API für Audio-Aussprachedienste.

# faqQ4Title
source: Is my data secure?
de: Ist meine Daten sicher?

# faqQ4Description
source: Yes, we use JWT-based authentication and secure session management to protect your data.
de: Ja, wir verwenden JWT-basierte Authentifizierung und sicheres Sitzungsmanagement, um Ihre Daten zu schützen.

# faqQ5Title
source: How is the platform themed?
de: Wie ist die Plattform gestaltet?

# faqQ5Description
source: VokabelProfi offers a modern, customizable theme that adapts to both light and dark modes. Users can experience a visually appealing interface that aligns with their personal preferences, ensuring a comfortable and immersive learning environment.
de: VokabelProfi bietet ein modernes, anpassbares Thema, das sowohl für den hellen als auch für den dunklen Modus geeignet ist. Benutzer können eine optisch ansprechende Benutzeroberfläche erleben, die sich an ihre persönlichen Vorlieben anpasst und eine angenehme und eindringliche Lernumgebung gewährleistet.

# faqQ6Title
source: Is VokabelProfi mobile-friendly?
de: Ist VokabelProfi mobilfreundlich?

# faqQ6Description
source: Yes, VokabelProfi is designed to be fully responsive and optimized for mobile devices. Whether you're using a phone, tablet, or desktop, the platform adapts seamlessly to provide a smooth and user-friendly experience on all screen sizes.
de: Ja, VokabelProfi wurde entwickelt, um vollständig anpassungsfähig und für mobile Geräte optimiert zu sein. Egal, ob Sie ein Telefon, Tablet oder einen Desktop verwenden, die Plattform passt sich nahtlos an, um eine reibungslose und benutzerfreundliche Erfahrung auf allen Bildschirmgrößen zu bieten.

# faqQ7Title
source: Is VokabelProfi accessible for disabled users?
de: Ist VokabelProfi für behinderte Benutzer zugänglich?

# faqQ7Description
source: Yes, VokabelProfi is designed with accessibility in mind. The platform includes features like screen reader compatibility, keyboard navigation, and appropriate contrast levels to ensure that users with disabilities can effectively engage with the content and improve their language skills.
de: Ja, VokabelProfi wurde mit Blick auf Barrierefreiheit entwickelt. Die Plattform umfasst Funktionen wie Bildschirmleser-Kompatibilität, Tastaturnavigation und geeignete Kontraststufen, um sicherzustellen, dass Benutzer mit Behinderungen effektiv mit den Inhalten interagieren und ihre Sprachfähigkeiten verbessern können.

# klimaQuestion
source: What is the meaning of Klima?
de: Was bedeutet Klima?

# correctFeedback
source: Correct! this.exercises[this.currentExerciseIndex].german_word means this.exercises[this.currentExerciseIndex].correctOption .
de: Richtig! this.exercises[this.currentExerciseIndex].german_word bedeutet this.exercises[this.currentExerciseIndex].correctOption .

# incorrectFeedback
source: Incorrect! The correct answer is this.exercises[this.currentExerciseIndex].correctOption .
de: Falsch! Die richtige Antwort ist this.exercises[this.currentExerciseIndex].correctOption .

# noWordsForSelection
source: No words available for the selection at this moment
de: Derzeit sind keine Wörter für die Auswahl verfügbar

# errorFetchingWords
source: Error fetching words for the selected lesson
de: Fehler beim Abrufen der Wörter für die ausgewählte Lektion

# cefrProgressTitle
source: Your CEFR Level Progress
de: Ihr CEFR-Level-Fortschritt

# lessonProgressTitle
source: Lesson Progress for Selected CEFR Level
de: Lektionsfortschritt für das ausgewählte CEFR-Niveau

# selectCefrLevelLabel
source: Select CEFR Level:
de: Wählen Sie CEFR-Niveau:

# logInToSeeProgress
source: You need to log in to view your progress. Please log in to continue.
de: Sie müssen sich anmelden, um Ihren Fortschritt zu sehen. Bitte melden Sie sich an, um fortzufahren.

# noInfoProgress
source: No info found for the selected CEFR level
de: Keine Informationen für das ausgewählte CEFR-Niveau gefunden

# tipsTitle
source: Tips for Maximizing Your Learning with VokabelProfi
de: Tipps zur Maximierung Ihres Lernens mit VokabelProfi

# tip1Title
source: 1. Set Clear Goals
de: 1. Setzen Sie sich klare Ziele

# tip1Description
source: Define specific language learning goals, such as mastering a certain CEFR level or completing a set number of exercises per day. Setting clear goals will help you stay focused and motivated.
de: Definieren Sie spezifische Sprachlernziele, z. B. das Beherrschen eines bestimmten CEFR-Niveaus oder das Abschließen einer bestimmten Anzahl von Übungen pro Tag. Klare Ziele zu setzen hilft Ihnen, fokussiert und motiviert zu bleiben.

# tip2Title
source: 2. Consistency is Key
de: 2. Beständigkeit ist der Schlüssel

# tip2Description
source: Make learning a daily habit. Consistency will reinforce your memory and language skills over time. Try to dedicate at least 10-15 minutes a day to practice.
de: Machen Sie das Lernen zur täglichen Gewohnheit. Beständigkeit wird Ihr Gedächtnis und Ihre Sprachfähigkeiten im Laufe der Zeit festigen. Versuchen Sie, sich mindestens 10-15 Minuten pro Tag zum Üben zu widmen.

# tip3Title
source: 3. Use Progress Tracking
de: 3. Verwenden Sie die Fortschrittsverfolgung

# tip3Description
source: Regularly check your progress through the platform’s tracking tools. Seeing your progress can boost your motivation and give you insight into areas that need improvement.
de: Überprüfen Sie regelmäßig Ihren Fortschritt mit den Verfolgungswerkzeugen der Plattform. Ihren Fortschritt zu sehen kann Ihre Motivation steigern und Ihnen Einblicke in Bereiche geben, die verbessert werden müssen.

# tip4Title
source: 4. Diversify Your Learning
de: 4. Diversifizieren Sie Ihr Lernen

# tip4Description
source: Mix up your learning routine with different types of exercises, such as multiple-choice questions, translation tasks, and pronunciation practice. Diversifying your activities will keep you engaged and help reinforce your learning.
de: Mischen Sie Ihre Lernroutine mit verschiedenen Arten von Übungen, wie Multiple-Choice-Fragen, Übersetzungsaufgaben und Ausspracheübungen. Ihre Aktivitäten zu diversifizieren wird Sie engagiert halten und Ihr Lernen festigen.

# tip5Title
source: 5. Take Advantage of Audio Features
de: 5. Nutzen Sie die Audiofunktionen

# tip5Description
source: Use the integrated audio features to practice pronunciation and improve your listening skills. Repeating after the audio will help you get used to the sounds and rhythm of the language.
de: Verwenden Sie die integrierten Audiofunktionen, um die Aussprache zu üben und Ihre Hörfähigkeiten zu verbessern. Das Wiederholen nach dem Audio wird Ihnen helfen, sich an die Klänge und den Rhythmus der Sprache zu gewöhnen.

# tip6Title
source: 6. Review Regularly
de: 6. Regelmäßig überprüfen

# tip6Description
source: Periodically review past exercises to refresh your memory. Regular reviews will help you retain what you’ve learned and strengthen your long-term memory.
de: Überprüfen Sie regelmäßig vergangene Übungen, um Ihr Gedächtnis aufzufrischen. Regelmäßige Überprüfungen helfen Ihnen, das Gelernte zu behalten und Ihr Langzeitgedächtnis zu stärken.

# tip7Title
source: 7. Utilize the CEFR Structure
de: 7. Nutzen Sie die CEFR-Struktur

# tip7Description
source: Leverage the structured CEFR levels to guide your learning. The CEFR framework ensures that you are progressing in a systematic way, which is particularly helpful for mastering vocabulary and grammar at each level.
de: Nutzen Sie die strukturierten CEFR-Niveaus, um Ihr Lernen zu lenken. Der CEFR-Rahmen stellt sicher, dass Sie systematisch vorankommen, was besonders hilfreich ist, um Wortschatz und Grammatik auf jedem Niveau zu beherrschen.

# audioSupportMessage
source: Your browser does not support the audio element.
de: Ihr Browser unterstützt das Audioelement nicht.

# seekSlider
source: Seek through the audio
de: Durch das Audio navigieren

# cancelButton
source: No
de: Nein

# confirmButton
source: Yes
de: Ja

# footerText
source: © {{ currentYear }} Shahriar Malik. All rights reserved.
de: © {{ currentYear }} Shahriar Malik. Alle Rechte vorbehalten.

# menuButton
source: Menu
de: Menü

# learnButton
source: Learn
de: Lernen

# exercisesButton
source: Exercises
de: Übungen

# tipsButton
source: Tips
de: Tipps

# myProgressButton
source: My Progress
de: Mein Fortschritt

# adminButton
source: Admin
de: Administrator

# wordsManagementButton
source: Words Management
de: Wortverwaltung

# exercisesManagementButton
source: Exercises Management
de: Übungsverwaltung

# logoutButton
source: Logout
de: Abmelden

# englishFlagAlt
source: English Flag
de: Englische Flagge

# germanFlagAlt
source: German Flag
de: Deutsche Flagge

# toggleThemeButton
source: Toggle Theme
de: Thema wechseln

# darkMode
source: Dark
de: Dunkel

# lightMode
source: Light
de: Hell

# previousButton
source: Previous
de: Zurück

# nextButton
source: Next
de: Weiter

# pageSizeAriaLabel
source: Select page size
de: Seitengröße wählen

# pageSizeOption
source: {{ size }} per page
de: {{ size }} pro Seite
